from aiogram.types.web_app_info import WebAppInfo

def open_file(path):
    return open(path, 'rb')
excur_data = {
    'excur_military_volgograd': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Военный Волгоград*''',
        'buy': 'military_volgograd',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_interactive_volgograd': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Интерактивный Волгоград*''',
        'buy': 'interactive_volgograd',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_roman_volgograd': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Романтический Волгоград*''',
        'buy': 'roman_volgograd',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_histori_astrakhan': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Историческая Астрахань*''',
        'buy': 'histori_astrakhan',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_interactive_astrakhan': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Интерактивная Астрахань*''',
        'buy': 'interactive_astrakhan',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_fish_astrakhan': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Рыбный маршрут Астрахани*''',
        'buy': 'fish_astrakhan',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_yalta0secret_crimea': {
        'photo_excur':'https://i.mycdn.me/i?r=AyH4iRPQ2q0otWIFepML2LxRTIjJfiRGgoOiPO74SeMGmg',
        'text_excur': '''Давайте совершим увлекательную прогулку по знаменитой набережной Ялты, поверьте, она полна загадок и тайн.🧐

Набережная пережила большие изменения за почти 2 века своего существования и нам есть что Вам рассказать.😊

🌴В ходе экскурсии обратим Ваше внимание на все детали, известные исторические события, а также современную архитектуру и быт местных жителей.

Покажем самые вкусные места и насладимся красотой природы нашего замечательного города.🌸

P.S. Стоимость указана без действия промокода.
Пожалуйста, если у вас есть промокод - сначала зарегистрируйте его. После чего переходите в оплату. ✅

После покупки - квестом можно воспользоваться в течение 3 месяцев.3️⃣
Важно. Если вы начали проходить квест - срок его действия 24 часа. 

Прогулка подразумевает в себе то, что вы можете параллельно отдыхать, обедать, пить кофе ☕️ и через время продолжать маршрут. 

❗️❗️❗️
Если у вас возникли вопросы, напишите нам в службу поддержки''',
        'buy': 'yalta0secret_crimea',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_interactive_crimea': {
        'photo_excur': 'https://rezhpt.ru/wp-content/uploads/2021/10/image.jpg?w=640',
        'text_excur': '''*описание к экскурсии Интерактивный Крым*''',
        'buy': 'interactive_crimea',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    },
    'excur_street0yalta_crimea': {
        'photo_excur': 'https://img3.goodfon.ru/original/960x800/e/11/krym-yalta-ulica-zdaniya-doma.jpg',
        'text_excur': '''Давайте прогуляемся по самым нетуристическим маршрутам Ялты и окунемся в историю и реальный быт знаменитых жителей этого прекрасного города.😊

Ученых, врачей, писателей министров и многих других привлекала Ялта во все времена.😎

Старые улочки Ялты сохранили колорит прошлых времён, гармоничный природе и окружающему ландшафту.🌴

Представляйте себя жителем Ялты на рубеже 19-20 веков, почувствуйте их настроение и ритм жизни.🧳

Настало время окунуться в мир истории.🕵️''',
        'buy': 'street0yalta_crimea',
        'webAppExcur': WebAppInfo(url='https://nanobotartem2208.github.io/SDVVVD/')
    }
}
